#c = int(input("vedy:"))
#while c != n:
 #   if c < 100:

#     print(c)





'''
1. Вывести на экран все числа начиная с 0, пока сумма всех этих чисел не превысит 1000.
2.Пользователь вводит число. Программа завершится, когда пользователь
введет значение больше 100. Ответ: Вы ввели число больше 100
'''

i = 0
a = int(input('number: '))
while i < 1000:

    if a < 100:
        i += a
        print(i)
    else:
        print('numer < 100')
        break


















